import {
    ServicesContainer,
    ServicesH1,
    ServicesH2
} from './FAQElements';


const FAQ = () => {
    return (
        <ServicesContainer id="faqs">
                <ServicesH1>1. В: Что такое NeuroWeb?</ServicesH1>
                <ServicesH2>- О: NeuroWeb - это универсальная веб-платформа, предназначенная для работы с нейронными сетями и машинным обучением. Она предоставляет ряд инструментов и моделей для решения таких задач, как компьютерное зрение, обработка естественного языка и классическое машинное обучение.</ServicesH2>

                <ServicesH1>2. В: Кому может быть полезен NeuroWeb?</ServicesH1>
                <ServicesH2>- О: NeuroWeb предназначен для широкого круга пользователей, включая специалистов по обработке данных, энтузиастов искусственного интеллекта, исследователей и всех, кто стремится использовать возможности искусственного интеллекта в своих проектах.</ServicesH2>

                <ServicesH1>3. В: Как я могу начать работу с NeuroWeb?</ServicesH1>
                <ServicesH2>- О: Посетите нашу страницу "Начало работы", чтобы начать свой путь в искусственный интеллект. Здесь вы найдете пошаговые инструкции по изучению моделей, созданию проектов и обучению собственного ИИ.</ServicesH2>

                <ServicesH1>4. В: Могу ли я импортировать в NeuroWeb собственные данные?</ServicesH1>
                <ServicesH2>- О: Конечно! NeuroWeb позволяет импортировать собственные данные, что упрощает применение ИИ к конкретным проектам и наборам данных.</ServicesH2>

                <ServicesH1>5. В: Какие модели доступны в NeuroWeb?</ServicesH1>
                <ServicesH2>- О: NeuroWeb предлагает широкий спектр моделей, включая модели для компьютерного зрения, обработки естественного языка и классического машинного обучения. Каждая из них предназначена для решения конкретных задач и приложений.</ServicesH2>

                <ServicesH1>6. В: Требуются ли знания программирования для работы с NeuroWeb?</ServicesH1>
                <ServicesH2>- О: Хотя некоторое знакомство с Python и концепциями машинного обучения не помешает, NeuroWeb разработан с учетом удобства для пользователя, что делает его доступным для широкой аудитории.</ServicesH2>

                <ServicesH1>7. В: Как я могу визуализировать и анализировать результаты своих ИИ-проектов?</ServicesH1>
                <ServicesH2>- О: NeuroWeb предоставляет интуитивно понятные инструменты для визуализации данных и анализа эффективности моделей. Это позволяет получать глубокие знания и принимать обоснованные решения на основе полученных результатов.</ServicesH2>

                <ServicesH1>8. В: Могу ли я экспортировать модели, которые я обучаю в NeuroWeb, для использования вне платформы?</ServicesH1>
                <ServicesH2> - О: Да, у вас есть возможность экспортировать обученные модели, что позволяет интегрировать их в другие приложения или системы.</ServicesH2>

                <ServicesH1>9. В: Какая поддержка доступна пользователям NeuroWeb?</ServicesH1>
                <ServicesH2> - О: NeuroWeb предлагает ряд ресурсов поддержки, включая документацию, учебные пособия и форум сообщества. Наша команда также готова помочь в решении любых технических вопросов.</ServicesH2>

                <ServicesH1>10. В: Как я могу быть в курсе последних разработок и возможностей NeuroWeb?</ServicesH1>
                <ServicesH2>- О: Следите за нами в социальных сетях и подпишитесь на нашу рассылку, чтобы регулярно получать информацию о новейших возможностях, моделях и достижениях в области технологий искусственного интеллекта в NeuroWeb.</ServicesH2>
        </ServicesContainer>
    )
}

export default FAQ;
