import {
    ServicesContainer,
    ServicesH1,
    ServicesH2
} from './PrivatePolicyElements';


const FAQ = () => {
    return (
        <ServicesContainer id="faqs">

                <ServicesH1>Политика конфиденциальности NeuroWeb</ServicesH1>
            
                <ServicesH2>Последнее обновление: 16.10.2023</ServicesH2>

                <ServicesH2>Добро пожаловать на NeuroWeb! Наша команда ценит вашу доверенность и обязуется обеспечивать надежную защиту ваших личных данных. Ниже приведено описание того, как мы собираем, используем и защищаем информацию о пользователях NeuroWeb.</ServicesH2>

                <ServicesH2>1. Сбор и Использование Личной Информации</ServicesH2>

                <ServicesH2>Мы собираем личную информацию, предоставленную пользователями в процессе регистрации и использования NeuroWeb. Это может включать в себя имя, адрес электронной почты, контактную информацию и другие данные, необходимые для предоставления услуг.</ServicesH2>

                <ServicesH2>Мы используем эту информацию для предоставления доступа к функциям NeuroWeb, обновления пользователя о новых возможностях и событиях, а также для улучшения качества наших услуг.</ServicesH2>

                <ServicesH2>2. Защита Информации</ServicesH2>

                <ServicesH2>Мы применяем современные технические и организационные меры для защиты личной информации от несанкционированного доступа, утечек или разглашения. Мы также обучаем наших сотрудников и партнеров основам безопасности данных.</ServicesH2>

                <ServicesH2>3. Разглашение Личной Информации</ServicesH2>
                
                <ServicesH2>Мы не продаем, не обмениваем и не передаем личную информацию третьим сторонам без вашего согласия, за исключением случаев, предусмотренных законодательством</ServicesH2>

                <ServicesH2>4. Использование Cookies и Аналитики</ServicesH2>

                <ServicesH2>Мы можем использовать технологии, такие как файлы cookies и аналитические инструменты, для сбора анонимной информации о поведении пользователей на NeuroWeb. Эти данные помогают нам улучшить работу платформы и предоставить более релевантный контент.</ServicesH2>

                <ServicesH2>5. Ваши Права и Управление Информацией</ServicesH2>

                <ServicesH2>Вы имеете право запросить доступ к своей личной информации, а также внести изменения или удалить ее. Вы можете также отозвать свое согласие на обработку данных или запросить ограничение ее использования.</ServicesH2>

                <ServicesH2>6. Связь с Нами</ServicesH2>

                <ServicesH2>Если у вас есть какие-либо вопросы, предложения или замечания относительно нашей политики конфиденциальности, пожалуйста, свяжитесь с нами по адресу: neuroweb@bg.com.</ServicesH2>

                <ServicesH2>Мы регулярно обновляем нашу политику конфиденциальности, поэтому рекомендуем периодически пересматривать ее для ознакомления с изменениями.</ServicesH2>

        </ServicesContainer>
    )
}

export default FAQ;
